app/views/articles/index.html.haml

  = link_to 'Users:', users_path
  = User.count
---
SELECT COUNT(*) FROM "users"