app/controllers/articles_controller.rb

SELECT "articles".* FROM "articles"
---
  def index
    @articles = Article.all

INSERT INTO "articles" ("title", "body", "price", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "test2"], ["body", "aza"], ["price", "3.0"], ["user_id", 1], ["created_at", "2015-05-17 22:06:52.405222"], ["updated_at", "2015-05-17 22:06:52.405222"]]
---
  def create
    	@article = Article.new(article_params)
    	@article.user = current_user
	#@article = current_user.build_article(article_params)

    respond_to do |format|
      if @article.save

UPDATE "articles" SET "body" = $1, "price" = $2, "updated_at" = $3 WHERE "articles"."id" = $4  [["body", "bleh!z"], ["price", "4.0"], ["updated_at", "2015-05-17 22:23:02.793220"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @article.update(article_params)

DELETE FROM "articles" WHERE "articles"."id" = $1  [["id", 1]]
---
  def destroy
    @article.destroy

SELECT  "articles".* FROM "articles" WHERE "articles"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_article
      @article = Article.find(params[:id])