app/controllers/articles_controller.rb

  def show
	@auteur = Article.find(params[:id]).user
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1  ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]